<?php
////////////////////////////////////////////////////////////////////////////////
echo "<pre><hr>
    2. Присвоить переменной \$а значение в промежутке [0..15]. 
    С помощью оператора switch организовать вывод чисел от \$a до 15.
<br>";
////////////////////////////////////////////////////////////////////////////////
$a = 5;
if ($a >= 0 && $a <= 15) {
    for ($a; $a <= 15; $a++) {
        switch ($a) {
            case $a:
                echo "$a ";
            default:
                "DEFAULT SWITCH CASE!";    
        }
    }
    echo "<br>Конец программы!";
}
else {
    echo "Неверно задано переменная \$a.";
}
////////////////////////////////////////////////////////////////////////////////
echo "</pre><hr>";
////////////////////////////////////////////////////////////////////////////////
