<?php
////////////////////////////////////////////////////////////////////////////////
echo "<pre><hr>
    3. Реализовать основные 4 арифметические операции в виде функций с двумя параметрами. 
    Обязательно использовать оператор return.
<br>";
////////////////////////////////////////////////////////////////////////////////
function arifmetica($a, $b, $operator) {
    switch ($operator) {
        case "+":
            return $a + $b;
        case "-":
            return $a - $b;
        case "*":
            return $a * $b;
        case "/":
            return $a / $b;
        default:
            return "DEFAULT SWITCH CASE VALUE";
    }
}
echo arifmetica(12, -5, "/");
////////////////////////////////////////////////////////////////////////////////
echo "</pre><hr>";
////////////////////////////////////////////////////////////////////////////////