<?php
////////////////////////////////////////////////////////////////////////////////
echo "<pre><hr>
    2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, 
    чтобы результат выглядел так:
    0 – это ноль.
    1 – нечетное число.
    2 – четное число.
    3 – нечетное число.
    …
    10 – четное число.
<br>";
////////////////////////////////////////////////////////////////////////////////
$i = 0;
do {
    if ($i === 0) {
        print("0 - это ноль<br>");
    }
    elseif ($i % 2 === 0) print("$i - это четное число<br>");
    if ($i % 2 === 1) print("$i - это нечетное число<br>");
    $i++;
} while ($i <= 10);
////////////////////////////////////////////////////////////////////////////////
echo "</pre><hr>";
////////////////////////////////////////////////////////////////////////////////