<?php
////////////////////////////////////////////////////////////////////////////////
echo "<pre><hr>
    3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, 
    а в качестве значений – массивы с названиями городов из соответствующей области. 
    Вывести в цикле значения массива, чтобы результат был таким:
    Московская область:
    Москва, Зеленоград, Клин
    Ленинградская область:
    Санкт-Петербург, Всеволожск, Павловск, Кронштадт
    Рязанская область … (названия городов можно найти на maps.yandex.ru)
<br>";
/**
 * А аа аб ав аг
 * Б ба бб бв бг
 * В ва вб вв вг
 */
////////////////////////////////////////////////////////////////////////////////
$array_obl = [
    "Область А" => ["Город аа", "Город аб", "Город ав", "Город аг"],
    "Область Б" => ["Город ба", "Город бб", "Город бв", "Город бг"],
    "Область В" => ["Город ва", "Город вб", "Город вв", "Город вг"]
];
foreach($array_obl as $obl) {
    // var_dump(key($array_obl));
    print(key($array_obl) . ":\n"); 
    next($array_obl); // перемесить указатель на следующий элемент массива
    foreach($obl as $gor) {
        print("{$gor}<br>");
    }
    print("\n");
}
////////////////////////////////////////////////////////////////////////////////
echo "</pre><hr>";
////////////////////////////////////////////////////////////////////////////////