<?php
header("Content-Type: text/html; charset=utf-8");
////////////////////////////////////////////////////////////////////////////////
echo "<pre><hr>
    4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания
    (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
    Написать функцию транслитерации строк.
<br>";
/**
 * 1.Входящую строку сделать массивом.
 * 2.Заменить все его символы по ключам заданного массива на их значения.
 * 3.Оставить без изменения отстутствующие символы.
 */
////////////////////////////////////////////////////////////////////////////////
$array_rus_letters = array(
	'а' => 'a', 'б' => 'b', 'в' => 'v',
	'г' => 'g', 'д' => 'd', 'е' => 'e',
	'ё' => 'e', 'ж' => 'zh', 'з' => 'z',
	'и' => 'i', 'й' => 'y', 'к' => 'k',
	'л' => 'l', 'м' => 'm', 'н' => 'n',
	'о' => 'o', 'п' => 'p', 'р' => 'r',
	'с' => 's', 'т' => 't', 'у' => 'u',
	'ф' => 'f', 'х' => 'h', 'ц' => 'c',
	'ч' => 'ch', 'ш' => 'sh', 'щ' => 'sch',
	'ь' => '\'', 'ы' => 'y', 'ъ' => '\'',
	'э' => 'e', 'ю' => 'yu', 'я' => 'ya',

	'А' => 'A', 'Б' => 'B', 'В' => 'V',
	'Г' => 'G', 'Д' => 'D', 'Е' => 'E',
	'Ё' => 'E', 'Ж' => 'Zh', 'З' => 'Z',
	'И' => 'I', 'Й' => 'Y', 'К' => 'K',
	'Л' => 'L', 'М' => 'M', 'Н' => 'N',
	'О' => 'O', 'П' => 'P', 'Р' => 'R',
	'С' => 'S', 'Т' => 'T', 'У' => 'U',
	'Ф' => 'F', 'Х' => 'H', 'Ц' => 'C',
	'Ч' => 'Ch', 'Ш' => 'Sh', 'Щ' => 'Sch',
	'Ь' => '\'', 'Ы' => 'Y', 'Ъ' => '\'',
	'Э' => 'E', 'Ю' => 'Yu', 'Я' => 'Ya',
);
function mbStringToArray($string, $encoding = 'UTF-8')
{
    $strlen = mb_strlen($string);
    while ($strlen) {
        $array[] = mb_substr($string, 0, 1, $encoding);
        $string = mb_substr($string, 1, $strlen, $encoding);
        $strlen = mb_strlen($string, $encoding);
    }
    return ($array);
}
var_dump( str_split(mbStringToArray("СтРоКа")) );

function transliterator($string) { // "СтРоКа"
	
}
transliterator("строКА");
////////////////////////////////////////////////////////////////////////////////
echo "</pre><hr>";
////////////////////////////////////////////////////////////////////////////////