<?php
/* Установка внутренней кодировки в UTF-8 */
// mb_internal_encoding("UTF-8");
////////////////////////////////////////////////////////////////////////////////
echo "<pre><hr>
    5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.
<br>";
////////////////////////////////////////////////////////////////////////////////
/**
 * Замена любых символов в строке на любые другие
 *
 * @param [string] $string - входная строка
 * @param [string] $a - что поменять
 * @param [string] $b - на что поменять
 * @return string
 */
function simbols_to_simbols($string, $a, $b) {
    $array = explode($a, $string);
    return implode($b, $array);
}

$string = "Я смотрю ты за себя взялся, курить бросил, по утрам бегаешь... Никак до пенсии решил дожить?";
echo simbols_to_simbols($string, " ", "_");
////////////////////////////////////////////////////////////////////////////////
echo "</pre><hr>";
////////////////////////////////////////////////////////////////////////////////