<?php
////////////////////////////////////////////////////////////////////////////////
echo "<pre><hr>
    8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».
<br>";
////////////////////////////////////////////////////////////////////////////////
$array_obl = [
    "Область А" => ["Киров", "Город аб", "Город ав", "Город аг"],
    "Область Б" => ["Город ба", "Киев", "Город", "Город бг"],
    "Область В" => ["Город ва", "Калининград", "Город вв", "Город вг"]
];
foreach($array_obl as $obl) {
    // var_dump(key($array_obl));
    print(key($array_obl) . ":\n"); 
    next($array_obl); // перемесить указатель на следующий элемент массива
    foreach($obl as $gor) {
        if (mb_substr($gor, 0, 1)=="К") {
            print("{$gor}<br>");
        }
    }
    print("\n");
}
var_dump(mb_substr("СТРОКА какая-то", -5, -2)); // 2 последних символа "то")
////////////////////////////////////////////////////////////////////////////////
echo "</pre><hr>";
////////////////////////////////////////////////////////////////////////////////