<?php
////////////////////////////////////////////////////////////////////////////////
echo "<pre><hr>
    9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке, 
    производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при 
    конструировании url-адресов на основе названия статьи в блогах).
<br>";

/**
 * Транслитерация и замена символов в строке.
 *
 * @param [type] $string - входная строка
 * @param [type] $a - что заменить в ней
 * @param [type] $b - на что заменить 
 * @param integer $length - длина строки поддающаяся транслитерации
 * @return string - транслитерованная и с замененными символами строка 
 */
function transliterator_srting_rus_to_eng($string, $a, $b, $length = -1) {
    $array = explode($a, $string);
    $string = implode($b, $array);

    $array_rus_letters = preg_split('~~u', $string, $length, PREG_SPLIT_NO_EMPTY); // Здесь лежит готовый массив из русских символов после обработки входной строки $string
  
	$array_rus_eng_letters = array(
		'а' => 'a', 'б' => 'b', 'в' => 'v',	'г' => 'g', 'д' => 'd', 'е' => 'e',
		'ё' => 'e', 'ж' => 'zh', 'з' => 'z', 'и' => 'i', 'й' => 'y', 'к' => 'k',
		'л' => 'l', 'м' => 'm', 'н' => 'n',	'о' => 'o', 'п' => 'p', 'р' => 'r',
		'с' => 's', 'т' => 't', 'у' => 'u',	'ф' => 'f', 'х' => 'h', 'ц' => 'c',
		'ч' => 'ch', 'ш' => 'sh', 'щ' => 'sch',	'ь' => '\'', 'ы' => 'y', 'ъ' => '\'',
		'э' => 'e', 'ю' => 'yu', 'я' => 'ya',
	
		'А' => 'A', 'Б' => 'B', 'В' => 'V',	'Г' => 'G', 'Д' => 'D', 'Е' => 'E',
		'Ё' => 'E', 'Ж' => 'Zh', 'З' => 'Z',	'И' => 'I', 'Й' => 'Y', 'К' => 'K',
		'Л' => 'L', 'М' => 'M', 'Н' => 'N',	'О' => 'O', 'П' => 'P', 'Р' => 'R',
		'С' => 'S', 'Т' => 'T', 'У' => 'U',	'Ф' => 'F', 'Х' => 'H', 'Ц' => 'C',
		'Ч' => 'Ch', 'Ш' => 'Sh', 'Щ' => 'Sch',	'Ь' => '\'', 'Ы' => 'Y', 'Ъ' => '\'',
		'Э' => 'E', 'Ю' => 'Yu', 'Я' => 'Ya',
    );
    
	foreach($array_rus_letters as $value) {
		if (array_key_exists($value, $array_rus_eng_letters)) { // если в массиве есть данный символ
			$trans_string .= $array_rus_eng_letters[$value]; // то заменить ключ на значение
        } 
        else {
            $trans_string .= $value; // иначе просто вывести символ как есть
        }
	}
	return $trans_string;
}
////////////////////////////////////////////////////////////////////////////////
$string = "Сидят две ПОМИДОРИНЫ на рельсах, одна другой говрит: 'смотри поезд', другая: 'где?', жмяк...жмяк...";
$string = transliterator_srting_rus_to_eng($string, " ", "_", 10);
print($string);
////////////////////////////////////////////////////////////////////////////////
echo "</pre><hr>";
////////////////////////////////////////////////////////////////////////////////